In [1]:
#panda
import pandas
pandas.__version__

'0.25.1'

In [2]:
import numpy as np
import pandas as pd

In [4]:
#series
c=pd.Series([45,122,123,456])
c

0     45
1    122
2    123
3    456
dtype: int64

In [5]:
c.values

array([ 45, 122, 123, 456], dtype=int64)

In [6]:
c.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
fruits = pd.Series([123,456,789,234], 
    index=['mango','apple','grapes','orange'])
fruits

mango     123
apple     456
grapes    789
orange    234
dtype: int64

In [8]:
fruits['mango']

123

In [9]:
fruits[1]

456

In [14]:
fruits.name = 'quantity'
fruits.index.name = 'types'
fruits

types
mango     123
apple     456
grapes    789
orange    234
Name: quantity, dtype: int64

In [15]:
np.log(fruits)

types
mango     4.812184
apple     6.122493
grapes    6.670766
orange    5.455321
Name: quantity, dtype: float64

In [16]:
fruits[fruits>1000]

Series([], Name: quantity, dtype: int64)

In [17]:
fruit_dict={'mango':123,'apple':124, 'grapes':125, 'orange':126}
print(fruit_dict)
pd.Series(fruit_dict)

{'mango': 123, 'apple': 124, 'grapes': 125, 'orange': 126}

mango     123
apple     124
grapes    125
orange    126
dtype: int64

In [19]:
data={"fruits": ["mango", "apple", "grapes", "orange", "kiwi"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "cost": [25, 120, 35,45,65]}
print(data)
data = pd.DataFrame(data)
data

{'fruits': ['mango', 'apple', 'grapes', 'orange', 'kiwi'], 'Year': [2013, 2014, 2013, 2014, 2014], 'cost': [25, 120, 35, 45, 65]}

   fruits  Year  cost
0   mango  2013    25
1   apple  2014   120
2  grapes  2013    35
3  orange  2014    45
4    kiwi  2014    65

In [21]:
dp = pd.DataFrame(data, columns=["Year", "fruits" ,"cost"])
dp

   Year  fruits  cost
0  2013   mango    25
1  2014   apple   120
2  2013  grapes    35
3  2014  orange    45
4  2014    kiwi    65

In [24]:
dp['extra'] = dp.Year / dp.cost
dp

   Year  fruits  cost      extra
0  2013   mango    25  80.520000
1  2014   apple   120  16.783333
2  2013  grapes    35  57.514286
3  2014  orange    45  44.755556
4  2014    kiwi    65  30.984615

In [25]:
dp['aligned'] = pd.Series(range(5), index=[0,1,2,3,4])
dp

   Year  fruits  cost      extra  aligned
0  2013   mango    25  80.520000        0
1  2014   apple   120  16.783333        1
2  2013  grapes    35  57.514286        2
3  2014  orange    45  44.755556        3
4  2014    kiwi    65  30.984615        4

In [26]:
dp.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'fruits': {0: 'mango', 1: 'apple', 2: 'grapes', 3: 'orange', 4: 'kiwi'},
 'cost': {0: 25, 1: 120, 2: 35, 3: 45, 4: 65},
 'extra': {0: 80.52,
  1: 16.783333333333335,
  2: 57.51428571428571,
  3: 44.75555555555555,
  4: 30.984615384615385},
 'aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [27]:
pd.DataFrame(dp.to_dict())

   Year  fruits  cost      extra  aligned
0  2013   mango    25  80.520000        0
1  2014   apple   120  16.783333        1
2  2013  grapes    35  57.514286        2
3  2014  orange    45  44.755556        3
4  2014    kiwi    65  30.984615        4

In [28]:
number= [{1:i,2:10*i}for i in range(6)]
print(number)
pd.DataFrame(number)

[{1: 0, 2: 0}, {1: 1, 2: 10}, {1: 2, 2: 20}, {1: 3, 2: 30}, {1: 4, 2: 40}, {1: 5, 2: 50}]

   1   2
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [29]:
pd.DataFrame([{'ab':1,'cd':2},{'ef':3,'gh':4}])

    ab   cd   ef   gh
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

In [30]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foot','ball'],
             index=['ab','cd','ef'])

    foot  ball
ab     2     2
cd     2     2
ef     2     2